app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build
    if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 02 Dec 2014 19:11:38 UTC +00:00], ["description", "New pin!"], ["updated_at", Tue, 02 Dec 2014 19:11:38 UTC +00:00]]